app/Controllers/CaloriesController.php

    public function calculate()
    {
        header("Access-Control-Allow-Origin: *");
        header("Access-Control-Allow-Headers: X-API-KEY, Origin, X-Requested-With, Content-Type, Accept, Access-Control-Request-Method");
        header("Access-Control-Allow-Methods: GET, POST, OPTIONS");
        if ($_SERVER['REQUEST_METHOD'] == "OPTIONS") {
            die();
        }

        $json = $this->request->getJSON();

        // Validasi input
        if (!$json || !isset($json->ingredients)) {
            return $this->fail("Mana data ingredients-nya bro?", 400);
        }

        $items = $json->ingredients;
        $totalCalories = 0;
        $details = [];

        $db = \Config\Database::connect();
        $builder = $db->table('ingredients');

        foreach ($items as $item) {
            $cleanItem = strtolower(trim($item));

            $result = $builder->like('food', $cleanItem)->get()->getRowArray();
---
SELECT *
FROM `ingredients`
WHERE `food` LIKE '%chicken%' ESCAPE '!'