app/Controllers/Home.php

            ['food' => 'white rice', 'calories' => 692],
        ];

        $db->table('ingredients')->insertBatch($data);
---
INSERT INTO `ingredients` (`calories`, `food`)
VALUES (127,'buttermilk'), (275,'cornstarch'), (240,'cheese'), (105,'cream cheese'), (100,'butter'), (110,'mayonnaise'), (125,'olive oil'), (185,'chicken'), (92,'lobster'), (155,'mackerel'), (110,'shrimp'), (20,'celery'), (6,'cucumbers'), (30,'eggplant'), (14,'lettuce'), (80,'onions'), (2,'parsley'), (26,'spinach'), (50,'tomatoes'), (55,'fresh'), (185,'avocado'), (245,'blueberries'), (40,'cantaloupe'), (100,'cherries'), (120,'figs'), (70,'grapes'), (30,'lemon juice'), (112,'orange juice'), (330,'frozen'), (200,'peaches'), (95,'pineapple'), (230,'raisins'), (242,'strawberries'), (120,'watermelon'), (460,'flour'), (748,'rice'), (692,'white'), (24,'bouillon'), (75,'chicken soup'), (80,'vegetable'), (98,'marshmallows'), (120,'honey'), (117,'ices'), (340,'mince'), (343,'pecans'), (325,'walnuts')